api/app/controllers/restaurants_controller.rb

    def index
        @restaurants = Restaurant.all # ORM method to create instance variable
---
SELECT "restaurants".* FROM "restaurants"

    def create # enforces name and cusine through model validations
        @restaurant = Restaurant.new(restaurant_params)

        #classic
        if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "cuisine_type", "created_at", "updated_at") VALUES ('Resto 1', '1 Smith Street', 'Thai', '2025-04-30 09:32:44.297908', '2025-04-30 09:32:44.297908') RETURNING "id"

    def search # our custom end point
        if params[:cuisine_type].present?
            @restaurants = Restaurant.where(cuisine_type: params[:cuisine_type])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."cuisine_type" = 'French'